DIMATE-GmbH/arduino-esp32/libraries/SD/src/sd_diskio.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

// Disable the automatic pin remapping of the API calls in this file
#define ARDUINO_CORE_BUILD

#include "sd_diskio.h"
#include "esp_system.h"
#include "esp32-hal-periman.h"

extern "C" {
#include "ff.h"
#include "diskio.h"
#if ESP_IDF_VERSION_MAJOR > 3
#include "diskio_impl.h"
#endif
//#include "esp_vfs.h"
#include "esp_vfs_fat.h"
char CRC7(const char *data, int length);
unsigned short CRC16(const char *data, int length);
}

typedef enum {
  GO_IDLE_STATE = 0,
  SEND_OP_COND = 1,
  SEND_CID = 2,
  SEND_RELATIVE_ADDR = 3,
  SEND_SWITCH_FUNC = 6,
  SEND_IF_COND = 8,
  SEND_CSD = 9,
  STOP_TRANSMISSION = 12,
  SEND_STATUS = 13,
  SET_BLOCKLEN = 16,
  READ_BLOCK_SINGLE = 17,
  READ_BLOCK_MULTIPLE = 18,
  SEND_NUM_WR_BLOCKS = 22,
  SET_WR_BLK_ERASE_COUNT = 23,
  WRITE_BLOCK_SINGLE = 24,
  WRITE_BLOCK_MULTIPLE = 25,
  APP_OP_COND = 41,
  APP_CLR_CARD_DETECT = 42,
  APP_CMD = 55,
  READ_OCR = 58,
  CRC_ON_OFF = 59
} ardu_sdcard_command_t;

typedef struct {
  uint8_t ssPin;
  SPIClass *spi;
  int frequency;
  char *base_path;
  sdcard_type_t type;
  unsigned long sectors;
  bool supports_crc;
  int status;
} ardu_sdcard_t;

static ardu_sdcard_t *s_cards[FF_VOLUMES] = {NULL};

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_ERROR
const char *fferr2str[] = {
  "(0) Succeeded",
  "(1) A hard error occurred in the low level disk I/O layer",
  "(2) Assertion failed",
  "(3) The physical drive cannot work",
  "(4) Could not find the file",
  "(5) Could not find the path",
  "(6) The path name format is invalid",
  "(7) Access denied due to prohibited access or directory full",
  "(8) Access denied due to prohibited access",
  "(9) The file/directory object is invalid",
  "(10) The physical drive is write protected",
  "(11) The logical drive number is invalid",
  "(12) The volume has no work area",
  "(13) There is no valid FAT volume",
  "(14) The f_mkfs() aborted due to any problem",
  "(15) Could not get a grant to access the volume within defined period",
  "(16) The operation is rejected according to the file sharing policy",
  "(17) LFN working buffer could not be allocated",
  "(18) Number of open files > FF_FS_LOCK",
  "(19) Given parameter is invalid"
};
#endif

/*
 * SD SPI
 * */

bool sdWait(uint8_t pdrv, int timeout) {
  char resp;
  uint32_t start = millis();

  do {
    resp = s_cards[pdrv]->spi->transfer(0xFF);
  } while (resp == 0x00 && (millis() - start) < (unsigned int)timeout);

  if (!resp) {
    log_w("Wait Failed");
  }
  return (resp > 0x00);
}

void sdStop(uint8_t pdrv) {
  s_cards[pdrv]->spi->write(0xFD);
}

void sdDeselectCard(uint8_t pdrv) {
  ardu_sdcard_t *card = s_cards[pdrv];
  digitalWrite(card->ssPin, HIGH);
}

bool sdSelectCard(uint8_t pdrv) {
  ardu_sdcard_t *card = s_cards[pdrv];
  digitalWrite(card->ssPin, LOW);
  bool s = sdWait(pdrv, 500);
  if (!s) {
    log_e("Select Failed");
    digitalWrite(card->ssPin, HIGH);
    return false;
  }
  return true;
}

char sdCommand(uint8_t pdrv, char cmd, unsigned int arg, unsigned int *resp) {
  char token;
  ardu_sdcard_t *card = s_cards[pdrv];

  for (int f = 0; f < 3; f++) {
    if (cmd == SEND_NUM_WR_BLOCKS || cmd == SET_WR_BLK_ERASE_COUNT || cmd == APP_OP_COND || cmd == APP_CLR_CARD_DETECT) {
      token = sdCommand(pdrv, APP_CMD, 0, NULL);
      sdDeselectCard(pdrv);
      if (token > 1) {
        break;
      }
      if (!sdSelectCard(pdrv)) {
        token = 0xFF;
        break;
      }
    }

    char cmdPacket[6];
    cmdPacket[0] = cmd | 0x40;
    cmdPacket[1] = arg >> 24;
    cmdPacket[2] = arg >> 16;
    cmdPacket[3] = arg >> 8;
    cmdPacket[4] = arg;
    if (card->supports_crc || cmd == GO_IDLE_STATE || cmd == SEND_IF_COND) {
      cmdPacket[5] = (CRC7(cmdPacket, 5) << 1) | 0x01;
    } else {
      cmdPacket[5] = 0x01;
    }

    card->spi->writeBytes((uint8_t *)cmdPacket, 6);

    if (cmd == STOP_TRANSMISSION) {
      // Discarding a single assumed "stuff byte" before searching for the
      // token (as the SD Physical Layer spec suggests) made no observed
      // difference - still the exact same 0x04 response on every call, on
      // every file. Capturing and logging the raw byte sequence here
      // instead of guessing further, to see the actual pattern.
      char rawBytes[16];
      for (int i = 0; i < 16; i++) {
        rawBytes[i] = card->spi->transfer(0xFF);
      }
      log_e(
        "sdCommand(): STOP_TRANSMISSION raw response bytes: %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x "
        "%02x %02x %02x %02x %02x",
        (unsigned char) rawBytes[0], (unsigned char) rawBytes[1], (unsigned char) rawBytes[2], (unsigned char) rawBytes[3],
        (unsigned char) rawBytes[4], (unsigned char) rawBytes[5], (unsigned char) rawBytes[6], (unsigned char) rawBytes[7],
        (unsigned char) rawBytes[8], (unsigned char) rawBytes[9], (unsigned char) rawBytes[10], (unsigned char) rawBytes[11],
        (unsigned char) rawBytes[12], (unsigned char) rawBytes[13], (unsigned char) rawBytes[14], (unsigned char) rawBytes[15]
      );

      token = 0xFF;
      for (int i = 0; i < 16; i++) {
        if (!(rawBytes[i] & 0x80)) {
          token = rawBytes[i];
          break;
        }
      }
    } else {
      for (int i = 0; i < 9; i++) {
        token = card->spi->transfer(0xFF);
        if (!(token & 0x80)) {
          break;
        }
      }
    }

    if (token == 0xFF) {
      log_w("no token received");
      sdDeselectCard(pdrv);
      delay(100);
      sdSelectCard(pdrv);
      continue;
    } else if (token & 0x08) {
      log_w("crc error");
      sdDeselectCard(pdrv);
      delay(100);
      sdSelectCard(pdrv);
      continue;
    } else if (token > 1) {
      log_w("token error [%u] 0x%x", cmd, token);
      break;
    }

    if (cmd == SEND_STATUS && resp) {
      *resp = card->spi->transfer(0xFF);
    } else if ((cmd == SEND_IF_COND || cmd == READ_OCR) && resp) {
      *resp = card->spi->transfer32(0xFFFFFFFF);
    }

    break;
  }
  if (token == 0xFF) {
    log_e("Card Failed! cmd: 0x%02x", cmd);
    card->status = STA_NOINIT;
  }
  return token;
}

bool sdReadBytes(uint8_t pdrv, char *buffer, int length) {
  char token;
  unsigned short crc;
  ardu_sdcard_t *card = s_cards[pdrv];

  uint32_t start = millis();
  do {
    token = card->spi->transfer(0xFF);
  } while (token == 0xFF && (millis() - start) < 500);

  if (token != 0xFE) {
    return false;
  }

  card->spi->transferBytes(NULL, (uint8_t *)buffer, length);
  crc = card->spi->transfer16(0xFFFF);
  return (!card->supports_crc || crc == CRC16(buffer, length));
}

char sdWriteBytes(uint8_t pdrv, const char *buffer, char token) {
  ardu_sdcard_t *card = s_cards[pdrv];
  unsigned short crc = (card->supports_crc) ? CRC16(buffer, 512) : 0xFFFF;
  if (!sdWait(pdrv, 500)) {
    return 0;
  }

  card->spi->write(token);
  card->spi->writeBytes((uint8_t *)buffer, 512);
  card->spi->write16(crc);
  return (card->spi->transfer(0xFF) & 0x1F);
}

